Revit 2026 API

# ItemFactoryBaseNewDimension(View, Line, ReferenceArray, DimensionType) Method

---

Creates a new linear dimension object using the specified dimension style.

**Namespace:** Autodesk.Revit.Creation**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public Dimension NewDimension(
	View view,
	Line line,
	ReferenceArray references,
	DimensionType dimensionType
)
```
```vb
Public Function NewDimension (
	view As View,
	line As Line,
	references As ReferenceArray,
	dimensionType As DimensionType
) As Dimension
```
```cpp
public:
Dimension^ NewDimension(
	View^ view,
	Line^ line,
	ReferenceArray^ references,
	DimensionType^ dimensionType
)
```
```fsharp
member NewDimension :
        view : View *
        line : Line *
        references : ReferenceArray *
        dimensionType : DimensionType -> Dimension
```

#### Parameters

view View
     The view in which the dimension is to be visible. The view must be  if the document is in [!:Autodesk::Revit::DB::SketchEditScope].
line Line
     The line drawn for the dimension.
references ReferenceArray
     An array of geometric references to which the dimension is to be bound.
dimensionType DimensionType
     The dimension style to be used for the dimension.

#### Return Value

Dimension If successful a new dimension object, otherwise .

| Exception | Condition |
| --- | --- |
| ArgumentException | Thrown when references are not geometric references. |

#### Reference

ItemFactoryBase Class

NewDimension Overload

Autodesk.Revit.Creation Namespace